# Welcome

## Merging in Pandas

Date: 11/17/2023

Data Analytics Working Group

## Goal

* Learn the Pandas merging method 

* Reference, https://pandas.pydata.org/docs/user_guide/merging.html

These notes will be available on [here](https://github.com/youngsuKim-CSUSB/presentations), https://github.com/youngsuKim-CSUSB/presentations.

# Preliminaries

## Basic JupyterLab 

* How to execute cells
* How to change mode; code/markdown/raw
* How to install Python packages
* How to comment and uncomment

## Import Pandas and CSV files

We first load the package Matplotlib by typing

> import pandas as pd

In [5]:
import pandas as pd

If the package is not installed, you can try one of the following methods without leaving the JupyterLab.

> conda install pandas

> pip install pandas

In [1]:
# conda install pandas

# Load CSV files as Datasets

Use `pd.read_csv(filename)` but first download the CSV files by typing

curl: try 'curl --help' or 'curl --manual' for more information

In [19]:
df1 = pd.read_csv("table1.csv")
df2 = pd.read_csv("table2.csv")
df3 = pd.read_csv("table3.csv")
df4 = pd.read_csv("table4.csv")
df5 = pd.read_csv("table5.csv")
df6 = pd.read_csv("table6.csv")
df7 = pd.read_csv("table7.csv")

In [23]:
display(df1,df2,df3,df4,df5,df6,df7)

   Column A  Column B
0         1        10
1         2        20
2         3        30
3         4        40
4         5        50

   Column A  Column B
0         6        60
1         7        70

   Column A  Column B
0         4        40
1         9        90

   Column A  Column B  Column C
0         1        10         2
1         2        20         4
2         3        30         6
3         4        40         8
4         5        50        10

   Column A  Column B
0         3        30
1         6        60

   Column A  Column B
0         2        20
1         3        30
2         6        60

   Column A  Column C
0         1         2
1         2         4
2         3         6
3         4         8
4         5        10

In [36]:
pd.merge(df5,df7, on=['Column A'], how='outer')

   Column A  Column B  Column C
0         3      30.0       6.0
1         6      60.0       NaN
2         1       NaN       2.0
3         2       NaN       4.0
4         4       NaN       8.0
5         5       NaN      10.0

In [37]:
# NaN means not a number

## Task

Counter the number of attendance points for this week.

1. Read files
> [ "roster.csv", "11-13-2023.csv", "11-14-2023.csv", "11-15-2023.csv", "11-17-2023.csv" ]
2. Merge data one by one
4. Replace NaN by 0
3. Create a column with the sum

In [45]:
# 1

files = [ "roster.csv", "11-13-2023.csv", "11-14-2023.csv", "11-15-2023.csv", "11-17-2023.csv" ]

roster = pd.read_csv(files[0])
df13 = pd.read_csv(files[1])
df14 = pd.read_csv(files[2])
df15 = pd.read_csv(files[3])
df17 = pd.read_csv(files[4])

In [46]:
roster

        Name
0  Student A
1  Student B
2  Student C
3  Student D
4  Student E
5  Student F
6  Student G
7  Student H

In [47]:
df13

        Name  11/13/23
0  Student A         1
1  Student D         2
2  Student C         1
3  Student E         2
4  Student B         1

In [64]:
df = pd.merge(roster, df13, on='Name', how='left')

        Name  11/13/23  11/14/23  11/15/23  11/17/23  Total
0  Student A       1.0       0.0       1.0       0.0    2.0
1  Student B       1.0       2.0       0.0       0.0    3.0
2  Student C       1.0       0.0       2.0       2.0    3.0
3  Student D       2.0       1.0       1.0       2.0    4.0
4  Student E       2.0       1.0       1.0       0.0    4.0
5  Student F       0.0       0.0       1.0       1.0    1.0
6  Student G       0.0       1.0       2.0       2.0    3.0
7  Student H       0.0       2.0       2.0       1.0    4.0

# Questions?

## Thank you!